вопросно-ответная система
<b>Вопросно-ответная система</b> (<i>QA-система</i>; <i>QA</i> - от англ. <i>Question-answering system</i>) - информационная система, способная принимать вопросы и отвечать на них на естественном языке, другими словами, это система с <b>естественно-языковым интерфейсом</b>.
keywords: вопросно ответная 
topic: Основные понятия

a.l.i.c.e.
<b>A.L.I.C.E.</b> - виртуальный собеседник, программа, способная вести диалог с человеком на естественном языке. Она создана по подобию первой программы-собеседника, <b>Элизы</b>, и использует технику эвристического сопоставления фразы пользователя с образцами в базе знаний.<br/>
<i>A.L.I.C.E.</i> - одна из лучших в своём роде, она три раза (в 2000, 2001, 2004 годах) становилась победителем <b>премии Лёбнера</b>. Несмотря на это, ни <i>A.L.I.C.E.</i>, ни другие программы не могут пока пройти <b>тест Тьюринга</b>.
keywords: alice a.l.i.c.e элис 
topic: Примеры чат-ботов

google now
Ok, Google...
keywords: окей нау гугл 
topic: Примеры чат-ботов

сири
<b>Siri</b> (рус. <i>Сири</i>, бэкр. англ. <i>Speech Interpretation and Recognition Interface</i>) - облачный персональный помощник и <b>вопросно-ответная система</b>, программный клиент которой входит в состав <i>iOS</i>, <i>watchOS</i>, <i>macOS</i>, и <i>tvOS</i> компании <i>Apple</i>.<br/>
Данное приложение использует <b>обработку естественной речи</b>, чтобы отвечать на вопросы и давать рекомендации.<br/>
<i>Siri</i> приспосабливается к каждому пользователю индивидуально, изучая его предпочтения в течение долгого времени.
keywords: siri 
topic: Примеры чат-ботов

алиса
<b>Алиса</b> - виртуальный голосовой помощник, созданный в компании <i>Яндекс</i>. Имитирует живой диалог, распознавая естественную речь (устную и письменную) и давая ответы на вопросы (произнося их вслух и выводя на экран).<br/>
Работает в приложениях <i>Яндекс</i> и <i>Яндекс.Браузер</i> для <i>iOS</i> и <i>Android</i>, а также в бета-версии <b>Голосового помощника</b> для <i>Windows</i>.
keywords: alisa 
topic: Примеры чат-ботов

элиза
<b>Элиза</b> (<i>ELIZA</i>) - виртуальный собеседник, знаменитая компьютерная программа <b>Джозефа Вейценбаума</b>, написанная им в 1966 году, которая пародирует диалог с психотерапевтом, реализуя технику активного слушания. Программа была названа в честь <b>Элизы Дулитл</b>, героини из пьесы <i>Пигмалион</i> Бернарда Шоу, которую обучали языку <i>высшего класса людей</i>.<br/>
Элиза просто выделяет во входной фразе значимые слова, которые подставляет в шаблонную фразу. <i>Пародия</i> на человека может раскрыться сразу или после нескольких диалогов, все зависит от того, как пользователь будет вести беседу. Иногда возникали забавные ситуации, когда увлечённый пользователь через несколько минут убеждался в отсутствии у машины понимания сути вопросов. Всё происходило из-за того, что человек придает каждому слову смысл, а машина интерпретирует слово как символьные данные.
keywords: eliza 
topic: Примеры чат-ботов

ms tay
Чат-бот от Microsoft, способный к самообучению, который всего за 24 часа стал расистом и сексистом.
keywords: microsoft тай тэй tay микрософт 
topic: Примеры чат-ботов

fb sam
Чат-бот политик от <font color="RoyalBlue"><b>Facebook</b></font>, SAM не обладает опытом живого политика, но многим людям он уже пришелся по душе: по крайней мере, он не способен принести вреда.  В отличие от живых политиков, он всегда доступен для диалога.  <br/>
Бот готов обсудить проблемы здравоохранения, образования, социальные проблемы или поговорить на любые другие темы.  При этом важно, что это будет не пространный диалог о глобальном - он будет привязан к реальной жизни в Новой Зеландии.  Бот знает статистику, разбирается в текущем состоянии дел и готов делиться этим с собеседником.  <br/>
Проект, скорее, задает вопрос обществу и заставляет задуматься о будущем, о функциях власти.  Это рассуждение авторов на тему того, что происходит с политикой сейчас и как она трансформируется потом.  Есть мнение, что ИИ в политических вопросах может обеспечить непредвзятость.  <br/>
Для алгоритма без желаний и страстей все люди будут одинаково важны - или на том уровне, на котором это запрограммируют.  Но это поднимает уже другие вопросы, не передаст ли человек свои представления о мире и свои стереотипы алгоритму.
keywords: фэйсбук политик фейсбук facebook сэм sam 
topic: Примеры чат-ботов

вопросы этики
Человеку важно живое общение с человеком. Когда человек видит, что его обслуживает робот, то может подумать, что тот, кто использует робота, избегает общения, т. е. не доверяет, получая <b>недоверие</b> в ответ.<br/>
Компании, которые могут себе это позволить, нанимают достаточно людей в службу поддержки, службы связи с общественностью и заключения договоров. Вряд ли кому будет приятно заключать контракт через бота.
keywords: этика 
topic: Преимущества и недостатки

недоверие
Недоверие к неизвестному и сомнение по поводу того, сможет ли чат-бот разрешить все интересующие вопросы. Как правило, недоверие - это результат незнания.
keywords: паранойя 
topic: Преимущества и недостатки

незнание
Это, возможно, самый большой недостаток чат-ботов. Всё потому, что всё основное знание в случае таких систем сокрыто от пользователя.<br/>
В начале диалога выдаётся только приветствие, и пользователь не знает, насколько обширно знание чат-бота, какие вопросы можно задать, на какие вопросы можно получить ответ. Чат-бот не обладает наглядностью графического интерфейса, он больше похож на коммандную строку с <b>естественно-языковым интерфейсом</b>.
keywords: скрыто 
topic: Преимущества и недостатки

экономия
Экономия достигается за счёт более рационального использования человеческих ресурсов, т. к. роботы задумывались как более эффективная альтернатива человеку...<br/>
Как бы, на первый взгляд, это некрасиво ни звучало, но в отдельных, очень специализированных, областях такая альтернатива является более эффективной.
keywords: экономичность 
topic: Преимущества и недостатки

доступность
Чат-боты способны обрабатывать запросы <i>24 часа и 7 дней в неделю</i>. Всё зависит от такого понятия как <b>аптайм</b>, времени доступности серверов, которое имеет показатели на уровне 99%, 99.9%, 99.99% и т. д.
keywords: аптайм 
topic: Преимущества и недостатки

объём запросов
Чат-боты способны обрабатывать колоссальные объёмы запросов. Всё зависит от сложности запросов, пропускной способности каналов связи, а также от архитектуры и вычислительной мощности оборудования, на котором работают чат-боты.
keywords: объем запросов объём 
topic: Преимущества и недостатки

минусы
Недостатки есть у любой технологии, т. к. не существует универсальных. С точки зрения применения чат-ботов в бизнесе есть несколько недостатков.<br/>
Например, <button><b>незнание</b></button> - многие пользователи, клиенты просто не знают как пользоваться чат-ботами, также может возникнуть <button><b>недоверие</b></button> к компании, которая <i>прячется за роботами</i>, избегая живого общения с клиентами. Такое недоверие перерастает уже в <button><b>вопросы этики</b></button>: общение между людьми - это межличностное взаимодействие, которое невозможно с неразумной машиной.
keywords: недостатки 
topic: Преимущества и недостатки
label: #чат-бот-преимущества-недостатки-минусы

плюсы
Для тех, кто использует чат-боты преимущества однозначны.<br/>
В бизнесе чат-боты могут интегрироваться в <button><b>Service Desk</b></button>, тем самым увеличивая <button><b>доступность</b></button> системы, увеличивая <button><b>объём запросов</b></button>, обрабатываемый за некоторый период системой, тем самым достигается <button><b>экономия</b></button> ресурсов (как человеческих, так и материальных).
keywords: преимущества 
topic: Преимущества и недостатки
label: #чат-бот-преимущества-недостатки-плюсы

преимущества и недостатки
Как технология чат-боты имееют свои <button><b>плюсы</b></button> и <button><b>минусы</b></button>, <b>преимущества</b> и <b>недостатки</b>. Как положительные, так и отрицательные стороны применения чат-ботов, например, в бизнесе, касаются как тех, кто их использует, так и тех, кто ими пользуется.
topic: Преимущества и недостатки
label: #чат-бот-преимущества-недостатки

бот сбербанка
Большинство действующих банковских ботов оперирует информационно-сервисными функциями. Например, официальный <font color="DodgerBlue"><b>Telegram</b></font>-бот <font color="Green"><b>Сбербанка</b></font> <b>@SberbankBot</b> позволяет узнать адреса ближайших отделений, банкоматов и партнеров бонусной программы, для этого нужно отправить боту свое местоположение. Также можно узнать актуальные котировки валют и драгметаллов, получить совет или получить информацию о банке, в том числе в видео-формате.
keywords: сбербанк сбербанка 
topic: Примеры чат-ботов

donotpay
К <b>DoNotPay</b> можно обратиться, чтобы вернуть деньги за покупки по кредитной карте, которые совершили мошенники, решить вопросы по декрету, запретить компаниям звонить с рекламными предложениями и многое другое. Обновлённый чат-бот поможет оформить документы, чтобы обязать владельца дома починить трубу или проверить газовое оборудование. Таким образом, он позволит не только сэкономить деньги, но и предотвратить трагедии.
keywords: дунотпэй 
topic: Примеры чат-ботов

штрафыбот
<b>ШтрафыБот</b> - этот чат-бот не только проверяет наличие штрафов, но и помогает погасить задолженность. Если после оплаты посредством бота на сайте <i>ГИБДД</i> все еще будет висеть информация о неоплаченном штрафе, программа вернет средства владельцу, даже если платеж был проведен.
keywords: гибдд штрафы 
topic: Примеры чат-ботов

shazam
Этот бот находит архивы известных радиостанций и отправляет названия песен в ответ на запрос, работает по аналогии с <b>Shazam</b>, используя не мелодию, а выдержку из текста песни.
keywords: радио шэзэм шазам шазэм шэзам radio 
topic: Примеры чат-ботов

ivi
Виртуальная девушка чат-бот Иви - один из самых популярных чат-ботов в мире. Она может общаться на разных языках, в том числе на русском. Коммуницировать с ней можно как при помощи текста, так и при помощи голоса. Отвечать она будет и голосом, и текстом одновременно. С <b>Ivi</b> можно обсудить любые вопросы и проблемы. С юмором у неё все в порядке, как и у <b>Алисы</b>. Можно посмеяться и потроллить.
keywords: иви ivi 
topic: Примеры чат-ботов

national geographic
При помощи этого бота можно получать лучшие фотографии <b>National Geographic</b> со всего мира через <font color="DodgerBlue"><b>Telegram</b></font>-мессенджер, заранее выбрав интересную тематику.
keywords: нэшнэл нэйшнл географик geographic national нэйшэнэл нэшнл джэографик 
topic: Примеры чат-ботов

meduza
<b>Meduza</b> - это официальный <font color="DodgerBlue"><b>Telegram</b></font>-бот независимого общественно-политического издания <b>Meduza</b>. Бот умеет показывать не только последние новости с сайта, но и присылать только те новости, которые актуальны для конкретного пользователя.
keywords: медуза meduza 
topic: Примеры чат-ботов

киоск rubot
Раньше, чтобы читать разные информационные порталы, приходилось добавлять в мессенджер виртуального докладчика конкретного издания. Таким образом, образовывалось огромное количество чатов. Но с появлением бота <b>Киоск RuBot</b> (<b>@kiosk_rubot</b>) нашлось решение и этой проблемы. <i>Киоск</i> открывает доступ к 57 новостным сайтам. Читать <i>Сноба</i>, <i>Ленту.ру</i>, <i>Новую газету</i> и другие издания можно в одном месте.
keywords: рубот kiosk киоск rubot 
topic: Примеры чат-ботов

lssender
С помощью <b>LSSender</b> можно автоматически рассылать во <i>ВКонтакте</i> сообщения, приглашения, отметки <i>мне нравится</i> и не только.<br/>
<small>PresentationBot Помогает готовиться к презентациям. Есть несколько вариантов: может посоветовать статьи, книги или публикации, подготовить план презентации вместе с пользователем либо направить на человека, который поможет с презентацией.</small>
keywords: lssender лссендер элэссендер 
topic: Примеры чат-ботов

вера
<b>Вера</b> - робот-рекрутер. Она найдет подходящие резюме, обзвонит кандидатов и проведет собеседование. <i>Вера</i> может за несколько минут сделать выборку из 5 работных сайтов по заданным требованиям. С помощью современных технологий Вера может звонить кандидатам и распознавать их речь. Еще <i>Вера</i> может отправить кандидатам на почту описание вакансии и может провести с ними видеособеседование.
keywords: вера верка vera 
topic: Примеры чат-ботов

hr-бот
<b>HR чат-бот</b> имеет реализацию нескольких функций. В первую очередь - это функция поиска по базе вакансий. Можно посмотреть все вакансии по Москве или Санкт-Петербургу. Можно посмотреть список всех компаний, которые предлагают работу. Можно искать вакансии: по ключевым словам, ключевым фразам или по названию компании.<br/>
Многофункциональная программа помогает <i>HR-менеджерам</i> использовать чат-боты для тестирования кандидатов. Благодаря встроенному конструктору, HR-менеджер может самостоятельно создавать чат-боты и публиковать их в мессенджерах <font color="Purple"><b>Viber</b></font>, <font color="RoyalBlue"><b>FacebookMessenger</b></font>, <font color="DodgerBlue"><b>Telegram</b></font>. Кандидатам остается только получить ссылку, зарегистрироваться и пройти тест.
keywords: hr вакансии работы работа хрбот вакансия 
topic: Примеры чат-ботов

примеры
Примеров чат-ботов немало, самые выдающиеся из них: <b>Элиза</b>, <b>A.L.I.C.E.</b> (Элис), <b>Алиса</b>, <button><b>Meduza</b></button>, <button><b>Shazam</b></button>, <button><b>LSSender</b></button>, <b>Fb SAM</b>, <b>MS Tay</b>, <button><b>Ivi</b></button>, <button><b>National Geographic</b></button>, <button><b>HR-бот</b></button>, <button><b>Киоск RuBot</b></button>, <button><b>Вера</b></button>, <button><b>ШтрафыБот</b></button>.
keywords: пример примеры 
topic: Примеры чат-ботов
label: #чат-бот-примеры

развлечение
Чат-бот может применяться для развлечений. Это может быть простая незатейливая <b>беседа</b>, стилизованная игра слов.<br/>
В индустрии развлечений могут применяться чат-боты, например, в компьютерных играх, в этом случае, по-видимому, их роль будет больше информативная, чем развлекательная.
<b>A.L.I.C.E.</b> бот является ярким примером того, как функционал чат-бота может использоваться для развлечений, а также быть объектом <b>исследования</b>.
keywords: развлекательный развлечения 
topic: Область применения
label: #чат-бот-область-применния-развлечение

поиск информации
Чат-бот может искать информацию для пользователя. В этом случае он выступает в качестве <b>вритуального ассистента</b>, или <b>виртуального цифрового помощника</b>.<br/>
Будучи интеграрованным с поисковой системой, чат-бот выдаёт ответ на вопрос, используя <b>естественно-языковой интерфейс</b>.
keywords: поиск поисковик 
topic: Область применения
label: #чат-бот-область-применения-поиск-информации

service desk
Для автоматизации работы с активными и потенциальными клинетами могут быть использованы чат-боты.<br/>
Например, в службах технической поддержки чат-бот может решить большой объём простых и самых часто возникающих вопросов, в случае более сложных - передать сотруднику службы технической поддержки.<br/>
Чат-боты могут использоваться для автоматизации оформления заказов, рассылки оповещений различным отделам организации и т. д.
keywords: сервис дэск техническая техподдержка деск 
topic: Область применения
label: #чат-бот-область-применения-service-desk

количество вопросов
#чат-бот-разработка-проблемы-предметная-область
topic: Проблемы разработки

предметная область
Множество вопросов, которое может задать пользователь, в общем случае, неперечислимо, а т. к. оно неперечислимо, то оно и не вычислимо.<br/>
Т. е. невозможно создать такую машину, которая бы отвечала на все вопросы, которые может задать пользователь. Поэтому чат-боты, как правило, разрабатываются для какой-то конкретной предметной области.<br/>
Чтобы чат-бот был максимально эффективен, то необходимо рассмотреть максимальное количество вопросов данной предметной области. А это может привести опять к неперечислимому множеству вопросов.<br/>
Количество вопросов, на которые отвечает чат-бот должно быть умеренно достаточное.
topic: Проблемы разработки
label: #чат-бот-разработка-проблемы-предметная-область

проблемы разработки
Несмотря на свою методичность, разработка чат-бота имеет свои проблемы. В основном это связано с тем, что чат-бот должен обрабатывать <button><b>естественные языки</b></button>. Также существуют проблемы с определением множества вопросов, на которые должна отвечать выбранная <button><b>предметная область</b></button>.
keywords: сложности препятствия трудности проблемы 
topic: Проблемы разработки
label: #чат-бот-разработка-проблемы

естественные языки
#чат-бот-основные-понятия-естественный-язык
topic: Основные понятия

естественный язык
<b>Естественный язык</b> - в лингвистике и философии языка язык, используемый для общения людей (в отличие от формальных языков и других типов знаковых систем, также называемых языками в семиотике) и не созданный целенаправленно (в отличие от искусственных языков).<br/>
Словарь и грамматические правила естественного языка определяются практикой применения и не всегда бывают формально зафиксированы.
topic: Основные понятия
label: #чат-бот-основные-понятия-естественный-язык

устройство
Чат-бот устроен несколько сложнее, чем можно подумать сначала, разные <button><b>виды</b></button> чат-ботов могут иметь очень похожие архитектуры.  <br/>
Например, <b>виртуальные собеседники</b> и <b>виртуальные цифровые помощники</b> на стороне клиента имеют программу, предоставляющую пользователю диалоговый интерфейс, <b>чат</b>.  Сама клиентская часть может быть реализована на любом <b>языке программирования</b> и на какой угодно <b>платформе</b> (Java-машина, операционная система, браузер).  <br/>
Клиентская часть через <b>Интернет</b> (либо просто локальную сеть) обращается к серверу посредством определённого вида запросов, протокола.  На стороне сервера также имеется <b>ИИ-движок</b>, к которому обращается серверная часть, обрабатывающая запросы от клиента.  <br/>
ИИ-движок в свою очередь обращается к базе данных, тем самым реализуя <b>базу знаний</b>.  В случае простых <b>интернет-ботов</b>, напоминающих пользователю о событиях, база знаний может отсутствовать (но, как правило, она есть).
keywords: принцип устройство принципы 
topic: Основные понятия
label: #чат-бот-устройство

искусственный интеллект
<b>Искусственный интеллект</b> (<i>ИИ</i>; англ. <i>Artificial intelligence</i>, <i>AI</i>) - это наука и технология создания интеллектуальных машин, особенно интеллектуальных компьютерных программ; а также свойство интеллектуальных систем выполнять творческие функции, которые традиционно считаются прерогативой человека.<br/>
<b>ИИ</b> связан со сходной задачей использования компьютеров для понимания человеческого интеллекта, но не обязательно ограничивается биологически правдоподобными методами.<br/>
Существующие на сегодня интеллектуальные системы имеют очень узкие области применения. Например, программы, способные обыграть человека в шахматы, не могут отвечать на вопросы и т. д.
keywords: ии 
topic: Основные понятия
label: #чат-бот-основные-понятия-искусственный-интеллект

основные понятия
Основные понятия чат-ботов - это некие основы, на которых строится объяснение по теме чат-ботов. Среди таких, возможно, стоит выделить понятия: <button><b>искуственный интеллект</b></button>, <button><b>тест Тьюринга</b></button>, <button><b>устройство</b></button> чат-бота, <button><b>база знаний</b></button>, <button><b>обработка естественных языков</b></button>, <b>вопросно-ответная система</b>, <b>чат</b>, <b>Интернет</b>, <b>голосовое управление</b> и т. д.
keywords: термины основы понятия 
topic: Основные понятия
label: #чат-бот-основные-понятия

исследование
Исследование в области <b>искусственного интеллекта</b> - тоже одна из <button><b>функций</b></button> чат-ботов. Так первоначально задумывалось при создании самого популярного чат-бота <b>A.L.I.C.E.</b><br/>
Проект <i>A.L.I.C.E.</i> является чат-ботом типа <button><b>виртуальный собеседник</b></button> и (на сегодняшний день) трижды занимал призовые места в <b>конкурсе Лебнера</b>, подразумевающий <button><b>тест Тьюринга</b></button>.
keywords: исследования исследований исследование 
topic: Функции чат-ботов
label: #чат-бот-функции-исследование

автоматизация
Автоматизация различных действий также является одной из <button><b>функций</b></button> чат-бота. При этом он может отправлять уведомления пользователю о каких-либо важных событиях, делать рассылку новостей, фильтровать сообщения в чате, одним словом, делать разного рода рутинную работу. Тут он может использоваться как <b>виртуальный ассистент</b>, <button><b>виртуальный цифровой помощник</b></button>, либо <button><b>интернет-бот</b></button>.
keywords: автоматизация автоматизации 
topic: Функции чат-ботов
label: #чат-бот-функции-автоматизация

управление
Среди <button><b>функций</b></button> чат-бота немаловажной является функция уравления. Будучи интегрированным в систему, чат-бот может осуществлять управление различными частями этой системы.<br/>
Например, чат-бот, интегрированный в систему "умный дом", может включать/выключать вентиляцию, отопление, свет, сигнализацию и т. д. Чат-бот, интегрированный в корпоративную информационную систему, может отправлять уведомления сотрудникам, отчёты руководителям, отправлять письма и т. д.<br/>
В этой роли чат-бот будет представлять собой консоль управления с <b>естественно-языковым интерфейсом</b>. Если подключить систему распознавания речи, то такой чат-бот превратится в <b>голосовой интерфейс управления</b>. Это характерно для чат-ботов типа <button><b>виртуальный цифровой помощник</b></button>.
keywords: управления управление 
topic: Функции чат-ботов
label: #чат-бот-функции-управление

беседа
Одной из основных <button><b>функций</b></button> чат-бота является способность вести диалог, поддерживать беседу. Особенно это касается чат-ботов типа <button><b>виртуальный собеседник</b></button> (программа-собеседник).<br/>
Предполагается, что идеальная <b>программа-собеседник</b> должна пройти <b>тест Тьюринга</b>.  Проводятся ежегодные конкурсы программ-собеседников (в основном англоязычных).  Один из самых известных - <b>конкурс Лебнера</b>.<br/>
Чтобы эффективно вести диалог, у чат-бота должна быть грамотно реализована <button><b>обработка естественных языков</b></button> (NLP). В этом заключается основная проблема, т. к. большинство технологий <b>NLP</b> орентированы на английский язык.
keywords: беседа болтовня незатейливая поболтать 
topic: Функции чат-ботов
label: #чат-бот-функции-беседа

виртуальный собеседник
<b>Виртуальный собеседник</b> (англ.  <i>chatterbot</i>) - это компьютерная программа для имитации речевого поведения человека при общении с одним или несколькими собеседниками.  По отношению к виртуальным собеседникам употребляется также название <b>программа-собеседник</b>.<br/>
Незатейливая <button><b>беседа</b></button> - это максимальная функциональная возможность большинства современных программ-собеседников. Для создания программ, способных понимать пользователя на естественном языке, требуются <button><b>исследования</b></button> в области <b>искусственного интеллекта</b>.<br/>
Программы, способные понимать отдельные высказывания пользователя, образуют класс программ с естественно-языковым интерфейсом,  например, <b>вопросно-ответная система</b>.
keywords: виртуальный собеседник программа-собеседник 
topic: Виды чат-ботов
label: #чат-бот-виды-виртуальный-собеседник

виртуальный цифровой помощник
<b>Виртуальный цифровой помощник</b> (англ.  <i>Virtual Digital Assistant</i>, сокращенно <i>VDA</i>) - веб-сервис и/или приложение для смартфонов и ПК, фактически исполняющий роль личного секретаря при пользователе.  Решает задачи планирования графика, организации и выполнения повседневных дел и контекстного поиска информации для нужд конкретного человека.  <br/>
Одним из важнейших отличий от предыдущих поколений планировщиков (<i>Personal Digital Assistant</i> - персональный цифровой помощник, сокращённо <i>PDA</i>; например, коммуникатор) и информационных менеджеров является учет контекста, в котором действует пользователь.  В первую очередь, его текущего положения в пространстве, что тесно связывает виртуальных цифровых помощников с геолокационными сервисами.  <br/>
Виртуальный цифровой помощник может создавать напоминания, подбирать места отдыха и развлечений, облегчить поиск и онлайн-бронирование билетов и столиков, заказ такси.  Он способен самообучаться в ходе выполнения заданий, анализируя поведение и интересы пользователя.
keywords: вцп помощник цифровой виртуальный 
topic: Виды чат-ботов
label: #чат-бот-виды-вцп

интернет-бот
<b>Робот</b>, или <b>бот</b>, а также <b>интернет-бот</b>, <b>www-бот</b> и т. п. (англ. <i>bot</i>, сокр. от чеш. <i>robot</i>) - специальная программа, выполняющая автоматически и/или по заданному расписанию какие-либо действия через интерфейсы, предназначенные для людей. При обсуждении компьютерных программ термин употребляется в основном в применении к <b>Интернету</b>.<br/>
Обычно боты предназначаются для выполнения работы, однообразной и повторяемой, с максимально возможной скоростью (очевидно, намного выше возможностей человека).
keywords: www-бот робот интернет-бот бот 
topic: Виды чат-ботов
label: #чат-бот-виды-интернет-бот

e-mail
Чат-боты могут успешно применяться для работы с электронной почтой. Интеграция чат-бота с почтовым ящиком предполагает, что он будет читать и отправлять электронные письма.
keywords: электронной email емейл e-mail почты эмэйл электронная почта имейл почтой 
topic: Интеграция с E-mail
label: #чат-бот-интеграция-e-mail

web-сайт
Классический вариант интеграции, который поддерживает практически любая платформа для создания чат-ботов - это интеграция с web-сайтом. В этом случае на сранице сайта появляется новый элемент управления с возможностью вызова чата, в котором будет отвечать чат-бот.
keywords: веб сайт web 
topic: Интеграция с web-сайтом
label: #чат-бот-интеграция-web-сайт

sms
Чат-бота можно настроить на отправку SMS-сообщений.
keywords: sms сообщения смс короткие 
topic: Интеграция с SMS
label: #чат-бот-интеграция-sms

wolfram alpha
Чат-бот может использовать прикладной интерфейс Wolfram Alpha для поиска по базе знаний Wolfram Alpha, которая предоставляет не только энциклопедические данные по запросу, но и способна производить символьные вычисления.
keywords: альфа wolfram alpha вычисления символьные вольфрам 
topic: Интеграция с Wolfram Alpha
label: #чат-бот-интеграция-wolfram-alpha

irc-каналы
Чат-бот может быть интегррован с IRC-каналом для поддержания его в активном состоянии, либо для модерации, фильтрации нецензурной лексики и т. д.
keywords: каналы irc иэрси ирс канал 
topic: Интеграция с IRC-каналами
label: #чат-бот-интеграция-irc-каналы

парсер e-mail
<b>TODO</b>: парсер e-mail

Он собирает e-mail по вашему запросу. Можно парсить одновременно сразу 10, 50, 100 запросов, например: Кожевенные мастерские Москвы, Кожевники Москвы, Изделия из кожи Москва И т.д.  по 5, 10, 25 стр. гугла, охватывая фактически по 250 сайтов для одного запроса и даже больше.
keywords: мэйлов email mail emailов парсер мэйл 
topic: Интеграция с E-mail

сопровождение
Разработчик чат-бота, как правило, предоставляет поддержку, иногда это обязательно, т. к. того требует <button><b>соглашение</b></button>. Это может быть техническая поддержка с оперативной обратной связью, может быть система учёта неисправностей и т. д. Всё зависит от уровня технического оснащения самого разработчика.
keywords: сопровождение поддержка 
topic: Разработка
label: #чат-бот-разработка-сопровождение

внедрение
Готовый продукт, т. е. чат-бота (после реализации), внедряют в систему заказчика. Во многих платформах предусмотрена <button><b>интеграция</b></button> с различными сервисами. Но на развёртывании чат-бота цикл разработки не заканчивается. Зачастую требуется дальнейшее <button><b>сопровождение</b></button>.
keywords: развертывание внедрение развёртывание 
topic: Разработка
label: #чат-бот-разработка-внедрение

тестирование
Очень важно проводить тестирование программного продукта перед тем, как его выпустить. Чат-боты не исключение. В виду специфики чат-ботов, чем больше людей тестируют чат-бота, тем он получится лучше. Если было обнаружено много серьёзных неисправностей, то чат-бота отдают обратно на этап <button><b>реализации</b></button> для исправления.
keywords: тест тестирование 
topic: Разработка
label: #чат-бот-разработка-тестирование

анализ
Первое, с чего стоило бы начинать разработку чат-бота - это заключение соглашения (перезаключение, уточнение, либо дополнительные соглашения) с заказчиком, анализ требований к чат-боту и предметной области. За этим этапом следует <button><b>проектирование</b></button>.
keywords: анализ соглашение 
topic: Разработка
label: #чат-бот-разработка-анализ

реализация
На этапе реализации решается вопрос о том, каким способом формируется база знаний чат-бота. Это может быть либо <button><b>обучение</b></button>, либо <button><b>программирование</b></button>, либо использоваться комбинированный подход. Также, перед тем, как осуществить <button><b>внедрение</b></button> проекта, проводят <button><b>тестирование</b></button>.
keywords: реализация реализации 
topic: Разработка
label: #чат-бот-разработка-реализация

бот
#чат-бот-виды-интернет-бот
topic: Виды чат-ботов
condition: false

pandorabots
<font color="DarkGreen"><b>Pandorabots</b></font> - одна из первых платформ для создания чат-ботов. Очень удобна для создания виртуальных собеседников наподобие <b>A.L.I.C.E.</b>
keywords: pandora пандоработс bots пандора ботс pandorabots 
topic: Платформы
label: #чат-бот-платформа-pandorabots

botlibre
Платформа <font color="SkyBlue"><b>Bot Libre!</b></font> удобна для создания виртуальных собеседников и виртуальных цифровых помощников (VDA).
keywords: ботлибре libre botlibre либре 
topic: Платформы
label: #чат-бот-платформа-botlibre

dialogflow
Платформа <font color="DarkOrange"><b>Dialogflow</b></font> неплохо подходит для создания виртуальных цифровых помощников (VDA).
keywords: флоу dialogflow flow диалог далогфлоу dialog 
topic: Платформы
label: #чат-бот-платформа-dialogflow

платформы
На сегодняшний день существует несколько платформ для создания чат-ботов. Среди них стоит выделить такие платформы как <button><font color="DarkOrange"><b>Dialogflow</b></font></button>, <button><font color="SkyBlue"><b>Bot Libre!</b></font></button> и <button><font color="DarkGreen"><b>Pandorabots</b></font></button>. Каждая из этих платформ имеет свои преимущества и недостатки, а также использует различные <button><b>языки программирования</b></button>.
topic: Платформы
label: #чат-бот-платформы

aiml
<font color="OrangeRed"><b>AIML</b></font> (англ.  <i>Artificial Intelligence Markup Language</i>) - язык разметки для искусственного интеллекта.  <font color="OrangeRed"><b>AIML</b></font> - подмножество (диалект) <font color="Green"><b>XML</b></font>, он предназначается для создания виртуальных собеседников.  Минимально необходимыми являются три тэга:<br/><font color="Green">&lt;category&gt;</font><br/>&nbsp;&nbsp;&nbsp;&nbsp;<font color="Green">&lt;pattern&gt;</font><font color="">ЧТО ТАКОЕ ЧАТ-БОТ</font><font color="Green">&lt;/pattern&gt;</font><br/>&nbsp;&nbsp;&nbsp;&nbsp;<font color="Green">&lt;template&gt;</font><font color="">Чат-бот - это компьютерная программа, которая создана для имитации речевого поведения человека при общении с одним или несколькими собеседниками.  </font><font color="Green">&lt;/template&gt;</font><br/><font color="Green">&lt;/category&gt;</font><br/>Этот язык разрабатывался Ричардом Уолессом - инициатором проекта <b>A.L.I.C.E.  </b> - и всемирным сообществом свободного ПО с 1995 по 2002 год.
keywords: aiml аимл 
topic: Языки программирования
label: #чат-бот-язык-программирования-aiml

self
Язык программирования <font color="SteelBlue"><b>Self</b></font> является скриптовым языком, который объединяет синтаксис языка <font color="Khaki"><b>JavaScript</b></font>, конечные автоматы (англ. <i>state machines</i>), образцы (англ. <i>patterns</i>) и базу данных объектов (базу знаний).
<br/>
Не стоит путать этот диалект <font color="Khaki"><b>JavaScript</b></font> с прототип-ориентированным языком <font color="SteelBlue"><b>Self</b></font>, изобретённым Дэвидом Унгаром в 1986 году.
keywords: сэлф self 
topic: Языки программирования
label: #чат-бот-язык-программирования-self

языки программирования
При создании чат-ботов используются различные языки программирования. Первым языком программирования, специально созданным для этого был <button><font color="OrangeRed"><b>AIML</b></font></button>. Впоследствии, с увеличением числа платформ для создания чат-ботов, увеличилось и количество используемых ими языков.
<br/>
Движок платформы <font color="DeepSkyBlue"><b>Bot Libre!</b></font> написан на <font color="SaddleBrown"><b>Java</b></font>, в нём имеется скриптовый язык для программирования функций - <button><font color="SteelBlue"><b>Self</b></font></button>, основанный на <font color="Khaki"><b>JavaScript</b></font>.
keywords: языке платформа программирования платформы языках язык движок 
topic: Языки программирования
label: #чат-бот-языки-программирования

программирование
<button><b>Реализация</b></button> чат-бота может осуществляться при помощи непосредственно программирования <button><b>базы знаний</b></button>, используя <button><b>языки программирования</b></button>, которые поддерживает та или иная платформа.
keywords: программирование 
topic: Программирование
label: #чат-бот-программирование

выводы
Стоит отметить, что пока ни пользователи, ни компании не осознают потребности в чат-ботах. Это происходит лишь потому, что о самой технологии пока известно немногим и немногое. Однако стоит сказать, что выиграет тот, кто раньше решит её использовать в своем бизнесе.
<br/>
Например, продажи лазеров в <font color="DimGray"><i>Endurance</i></font> увеличились на <b>30%</b> после того, как мы стали принимать заказы в мессенджерах, в то время как наши конкуренты продолжают общаться с клиентами по телефону и e-mail.
keywords: итог итоги резюме вывод 
topic: Компания Endurance
label: #чат-бот-выводы

blockchain
Данный чат-бот также обучен на ответы на общие вопросы про блокчейн, про криптовалюты, про распределенную базу данных и т. д. Проект реализован на английском языке.
keywords: ещё проект чат-бот blockchain проекта блокчейн еще далее 
previous: #чат-бот-blockchain
topic: Компания Endurance

blockchain
Последнее решение, которое было создано в <font color="DimGray"><b>Endurance</b></font> - это чат-бот, рассказывающий про <i>ICO Blockchain project INS.World</i>. Поскольку многие <i>ICO</i> проекты имеют ядро сообщества в группах таких мессенджеров как <font color="DodgerBlue"><b>Telegram</b></font>, то пользователям очень удобно писать и получать ответы прямо в самом мессенджере или даже в самой группе, задавая вопросы чат-боту.
keywords: проект blockchain проекта block-chain блокчейн блокчейна 
topic: Компания Endurance
label: #чат-бот-blockchain

endurance
В <font color="DimGray"><b>Endurance</b></font> создал несколько чат-ботов, которые помогают в обслуживании клиентов. Один из них отвечает на вопросы про лазеры. Для обучения использовалась вся база знаний за 3 года с вопросами и ответами. Сервис не может ответить на 100% возникающих вопросов, но на 80–85% он отвечает довольно точно.
keywords: клиентов облегчают обслуживать обслуживании помогать могут обслуживание людей помогают помощники упрощают 
topic: Компания Endurance

endurance
Пример того, как это встраивается в сайт: <a href="https://tehnoobzor.com/hi-tech-news/1883-chatbot-dlya-otvetov-na-voprosy.html"><i>https://tehnoobzor.com/hi-tech-news/1883-chatbot-dlya-otvetov-na-voprosy.html</i></a>.
keywords: может статья лазеры лазерах ответить обзорных вопросы отвечать статей обзор способен отвечающий 
topic: Компания Endurance

endurance
<i>Endurance</i>  в переводе с английского значит выносливость, что характеризует направление деятельности компании в целом.
keywords: endurance Endurance значит значение смысл перевод 
topic: Компания Endurance

endurance
Другое решение, которым очень охотно пользуются - это чат-бот, способный рассказать про чат-ботов. Который про них и рассказывает в данный момент.
keywords: пример встроить сайт например вопросы отвечающий 
topic: Компания Endurance

endurance
Как выглядит чат-бот, рассказывающий о чат-ботах? Он рассказывает и отвечает на вопросы про стоимость разработки, выгоды и преимущества, даёт сравнительные характеристики разных платформ, а также рассказывает о существующих решениях на рынке. Получая эту информацию, пользователи уже далее понимают насколько им эта тема интересна и на сколько они готовы двигаться дальше, чтобы обсуждать бизнес кейс.
keywords: умеет может рассказывает отвечать способен рассказывающий отвечающий отвечает 
topic: Компания Endurance

преимущества
Рассмотрев основные особенности чат-ботов <font color="DimGray"><b>Endurance</b></font>, их функциональность и возможности, можно сделать выводы, что это одно из лучших решений для экономии времени. Чат-боты быстро предоставят вам нужную информацию, напомнят о событии, запомнят нужные данные, отсортируют почту.
topic: Компания Endurance

тест тьюринга
<b>Тест Тьюринга</b> - эмпирический тест, идея которого была предложена Аланом Тьюрингом в статье <i>Вычислительные машины и разум</i>, опубликованной в 1950 году в философском журнале <i>Mind</i>.  Тьюринг задался целью определить, может ли машина мыслить.  <br/>
Стандартная интерпретация этого теста звучит следующим образом: <i>Человек взаимодействует с одним компьютером и одним человеком.  На основании ответов на вопросы он должен определить, с кем он разговаривает: с человеком или компьютерной программой.  Задача компьютерной программы — ввести человека в заблуждение, заставив сделать неверный выбор</i>.  <br/>
Все участники теста не видят друг друга.  Если судья не может сказать определённо, кто из собеседников является человеком, то считается, что машина прошла тест.  Чтобы протестировать именно интеллект машины, а не её возможность распознавать устную речь, беседа ведётся в режиме <b>только текст</b>, например, с помощью клавиатуры и экрана (компьютера-посредника).  Переписка должна производиться через контролируемые промежутки времени, чтобы судья не мог делать заключения, исходя из скорости ответов.  Во времена Тьюринга компьютеры реагировали медленнее человека.  Сейчас это правило тоже необходимо, потому что они реагируют гораздо быстрее, чем человек.
keywords: тьюринг тьюринг-тест тьюринга 
topic: Основные понятия
label: #чат-бот-основные-понятия-тест-тьюринга

принцип работы
#чат-бот-устройство
topic: Основные понятия

мессенджеры
Чат-боты могут работать, как на сайте, так и во многих мессенджерах. Среди таких мессенджеров самые популярные: <font color="SkyBlue"><b>Twitter</b></font>, <font color="RoyalBlue"><b>Facebook</b></font>, <font color="DodgerBlue"><b>Telegram</b></font>, <font color="Orange"><b>Slack</b></font>, <font color="DeepSkyBlue"><b>Skype</b></font>, <font color="LawnGreen"><b>WeChat</b></font>, <font color="LimeGreen"><b>Kik</b></font>.
keywords: kik skype slack скайп фейсбук messenger мессенджер twitter messengers wechat телеграм мессенджеры telegram facebook твиттер 
topic: Мессенджеры
label: #чат-бот-мессенджеры

область применения
Чат-боты могут применяться в различных областях и в различных сферах человеческой деятельности. Наиболее распространённые из них - это <button><b>Service Desk</b></button>, <button><b>поиск информации</b></button>, <button><b>автоматизация</b></button> и <b>голосовое управление</b>, а также <button><b>развлечения</b></button>.
keywords: распространение области сферы область применения распространения применение сфера 
topic: Область применения
label: #чат-бот-область-применения

создание
Сначала вместе с заказчиком составляются требования к чат-боту, исследуется предметная область, исследуются условия, в которых будет работать чат-бот. Затем предметная область должна быть разбита на подмножества, каждое из которых является независимым множеством вопросов и может передано в разработку. После этого начинается концептуальная проработка ответов на основе шаблонов вопросов. В результате получается первичная база знаний чат-бота. Но это ещё не всё. Боту также потребуются дополнительные скрипты и шаблоны.
topic: Разработка
label: #чат-бот-создание

бота сразу заказать
#чат-бот-заказ
topic: Чат-боты

виды
Термин <i>чат-бот</i> употребляют для обозначния разных концепций, таких как: <button><b>виртаульный собеседник</b></button>, <button><b>интернет-бот</b></button> или просто <b>бот</b>, а также <button><b>виртуальный цифровой помощник</b></button> или <b>VDA</b>.
keywords: классы вид тип классификация разновидность класс виды разновидности типы 
topic: Виды чат-ботов
label: #чат-бот-виды

удачные примеры
Успешных примеров довольно много. Например, чат-боты <font color="Indigo"><b>Microsoft</b></font>, чат-боты <font color="DarkGreen"><b>Себрбанка</b></font> и т. д. Также нельзя не упомянуть чат-ботов <font color="DimGray"><b>Endurance</b></font>.
topic: Чат-боты

перспективы
Боты — перспективное направление в развитии ИИ. Мимикрируя под людей, они получают больше доверия, способны приносить больше пользы и решать реальные проблемы. Человеку естественно говорить о проблемах в ходе диалога, боты дают такую возможность, снижая нагрузку на бизнес, на государственные учреждения. Когда алгоритм говорит человеческим голосом, обладает грамотной письменной речью, человеку все проще воспринимать его как полноценного собеседника. При этом технологии развиваются и боты получают человеческие лица, способные выражать эмоции. В конечном итоге боты плотнее внедряются не только в бизнес-процессы, но и во многие сферы жизни человека. Политика просто не могла остаться в стороне.
topic: Чат-боты

конфликты
С роботом особо не поконфликтуешь. Конфликт может возникнуть тогда, когда пользователь требует <i>живого общения</i>, а не разговора с <i>бездушной</i> и <i>глуповатой</i> машиной, после чего шлёт гневные обращения администрации ресурса. Хорошо продуманные электронные собеседники вызывают больше симпатии и завоёвывают расположение пользователя.
topic: Чат-боты

готовые решения
Описание готовых коммерческих решений можно найти по адресу: <a href="http://old.endurancerobots.com/opisanie-raboty-kommercheskix-chatbotov-endurance">http://old.endurancerobots.com/opisanie-raboty-kommercheskix-chatbotov-endurance</a>
topic: Чат-боты

crm интеграция
Можно сделать так, чтобы чат-бот отвечал на вопрос относительно статуса доставки или посылки. Для этого нужно интегрировать чат-бота в CRM систему, где хранятся данные о доставке с трек-номерами, после чего трек-номера можно проверять через API сервиса доставки.
keywords: crm 
topic: Интеграция

функции
Все функции чат-ботов можно разделить согласно тому, какие их существуют <b>виды</b>. Так <button><b>беседа</b></button> является неотъемлемой частью <b>виртуальных собеседников</b>. Также при их помощи проводятся <button><b>исследования</b></button> в области общего <b>искусственного интеллекта</b>. Такие функции, как <button><b>автоматизация</b></button> и <button><b>управление</b></button> присущи <b>виртуальным цифровым помощникам</b> и <b>интернет-ботам</b>.
keywords: функций функции функционал 
topic: Функции чат-ботов
label: #чат-бот-функции

стоимость
В среднем, стоимость разработки профессионального корпоративного чат-бота варьируется от 50 тыс. до 500 тыс. рублей, но, правда, бывают и исключения.
topic: Чат-боты
label: #чат-бот-стоимость

проектирование
Этап проектирования предполагает моделирование предметной области, либо функционала будущего чат-бота. Например, для моделирования чат-бота можно применить семантический граф, построенный на основе анализа предметной области, как на картинке: <img src="https://raw.githubusercontent.com/Endurance-Robotics/ChatBots/master/botabout/graph.png"/><br/>
После проектирования идёт непосредственно <button><b>реализация</b></button> чат-бота.
keywords: проектирование 
topic: Разработка
label: #чат-бот-разработка-проектирование

разработка
Процесс разработки чат-бота представляет собой поэтапный циклический процесс как на картинке: <img src="https://raw.githubusercontent.com/Endurance-Robotics/ChatBots/master/development.png"/><br/>
Основные этапы которого - это: <button><b>анализ</b></button>, <button><b>проектирование</b></button>, <button><b>реализация</b></button>, <button><b>тестирование</b></button>, <button><b>внедрение</b></button> и <button><b>сопровождение</b></button>.
keywords: разработке разработки разработка создание этапы 
topic: Разработка
label: #чат-бот-разработка

база знаний
В основе любого чат-бота, как правило (а для самообучающихся - это непременно так), лежит база знаний.

<b>База знаний, БЗ</b> (англ.  <i>knowledge base, KB</i>) — база данных, содержащая правила вывода и информацию о человеческом опыте и знаниях в некоторой предметной области.

Полноценные базы знаний (в отличие от обычной базы данных) содержат в себе не только фактическую информацию, но и правила вывода, позволяющие делать автоматические умозаключения об уже имеющихся или вновь вводимых фактах и тем самым производить семантическую (осмысленную) обработку информации.
keywords: знания построен лежит основе базис основа база данных данные основан знаний 
topic: Чат-боты

обучение
<b>Обучение (тренировка) чат-бота</b> - это противоположный проектированию способ разработки. Обучение осуществляется специалистами в режиме диалога с чат-ботом, в ходе которого специалист задаёт вопросы и проверяет правильность ответов, а чат-бот отвечает, а также сам задаёт вопросы, на которые специалист даёт эталонные ответы.

Чат-бот должен быть обучен на грамотных вопросах и грамотных ответах без частной информации (не должно быть имен или ссылок на предыдущие диалоги).  Кроме того, необходимо провести несколько пилотных тестирований. Даже если чат-бот создан и работает хорошо, его нужно постоянно улучшать, смотреть логи и корректировать ответы.
topic: Чат-боты

заказ
Ознакомиться с демонстрационными чат-ботами можно на странице сайта <i>Endurance</i> по адресу <a href="http://endurancerobots.com">http://endurancerobots.com</a>.

Заказать чат-бота можно, связавшись с представителями компании <i>Endurance</i>. Они помогут определиться с выбором и составить техническое задание.

Связаться с Георгием можно по телефону <b>+7 (916) 225 43 02</b>. Также можно оправить запрос на почту, ответив на несколько вопросов. Ответить на вопросы?
<br/>
<button>Да</button> <button>Нет</button>
keywords: заказ заказать определиться взять выбором выбрать 
topic: Чат-боты
label: #чат-бот-заказ

уделить время
#чат-бот-темы
keywords: время своего уделить времени спросить 
required: уделить времени 
topic: Чат-боты

темы
Я могу предоставить информацию по некоторым темам относительно чат-ботов: <button><b>основные понятия</b></button>, <button><b>виды</b></button> чат-ботов и их <button><b>функции</b></button>, как происходит <button><b>разработка</b></button> и <button><b>интеграция</b></button> с различными сервисами чат-ботов, <button><b>преимущества и недостатки</b></button>, а также <button><b>примеры</b></button> использования чат-ботов, какова их <button><b>область применения</b></button>, и какую роль играет компания <button><b>Endurance</b></button> в продвижении этой технологии.
keywords: беседа теме меню скажи тема спросить темам навигатор темами чем можешь рассказать поговорить какие навигация расскажи тем чём темы 
topic: Темы
label: #чат-бот-темы

интеграция
Разные платформы для создания чат-ботов предоставляют и различные способы интеграции чат-ботов с различными сервисами. Среди таких сервисов преимущественно различные <button><b>мессенджеры</b></button>. Также чат-бот способен работать с <b>электронной почтой</b>, <b>SMS</b>-сообщениями, <b>IRC</b>-каналами и сервисами <font color="Red"><b>Google</b></font>.
keywords: встроить встраивание сайт сайте интеграция google интегрировать гугл 
topic: Интеграция
label: #чат-бот-интеграция

эффективность
Чат-боты эффективны там, где работа оператора требует не глубокого понимания, а большого количества однообразной работы. Чат-бот способен быстро подобрать ответ на вопрос из конкретной области. Чат-бот способен заменить собой справочную систему.
keywords: эффективен эффективный эффективны эффективность 
topic: Область применения
label: #чат-бот-эффективность

помоги
#чат-бот-темы
keywords: помощь делать сделать помочь можешь оказать обучен 
topic: Чат-боты

чат-бот
<b>Чат-бот, виртуальный собеседник</b> (англ. <i>chatterbot</i>) - это компьютерная программа, которая создана для имитации речевого поведения человека при общении с одним или несколькими собеседниками. По отношению к виртуальным собеседникам употребляется также название программа-собеседник.

Чат-бот использует технологии искусственного интеллекта (ИИ), чтобы оказывать информационную поддержку, развлекать, квалифицировать собеседника (в случае коммерческих чат-ботов - клиента).
topic: Чат-боты

чат
<b>Чат, чаттер</b> (англ. <i>chatter</i> - болтать) - средство обмена сообщениями по компьютерной сети в режиме реального времени, а также программное обеспечение, позволяющее организовывать такое общение. Характерной особенностью является коммуникация именно в реальном времени или близкая к этому, что отличает чат от форумов и других "медленных" средств.
topic: Чат-боты
label: #чат-бот-чат

/start
Template("Добро пожаловать, {speaker}, я готов помочь с возникающими вопросами.")
topic: Чат-боты

привет
Приветствую, я могу помочь разобраться с вопросами на тему чат-ботов: что это такое, и какие они бывают, зачем они нужны, и как заказать чат-бота в <b>Endurance</b>. Я также могу ответить и на другие вопросы, но, разумеется не все. Для удобства лучше спросить о темах, либо использовать

<button>Навигатор по темам</button>
keywords: гутен salve здрасьте greetings морген привет доброе дела здоров прива здорова ghbdtn времени доброго hi hail суток добрый hello как здравствуйте здравствуй здаров хай утро вечер салют шалом 
topic: Чат-боты

