сопровождение
Разработчик чат-бота, как правило, предоставляет поддержку, иногда это обязательно, т. к. того требует <button><b>соглашение</b></button>. Это может быть техническая поддержка с оперативной обратной связью, может быть система учёта неисправностей и т. д. Всё зависит от уровня технического оснащения самого разработчика.
keywords: сопровождение поддержка 
topic: Разработка
label: #чат-бот-разработка-сопровождение

внедрение
Готовый продукт, т. е. чат-бота (после реализации), внедряют в систему заказчика. Во многих платформах предусмотрена <button><b>интеграция</b></button> с различными сервисами. Но на развёртывании чат-бота цикл разработки не заканчивается. Зачастую требуется дальнейшее <button><b>сопровождение</b></button>.
keywords: развертывание внедрение развёртывание 
topic: Разработка
label: #чат-бот-разработка-внедрение

тестирование
Очень важно проводить тестирование программного продукта перед тем, как его выпустить. Чат-боты не исключение. В виду специфики чат-ботов, чем больше людей тестируют чат-бота, тем он получится лучше. Если было обнаружено много серьёзных неисправностей, то чат-бота отдают обратно на этап <button><b>реализации</b></button> для исправления.
keywords: тест тестирование 
topic: Разработка
label: #чат-бот-разработка-тестирование

анализ
Первое, с чего стоило бы начинать разработку чат-бота - это заключение соглашения (перезаключение, уточнение, либо дополнительные соглашения) с заказчиком, анализ требований к чат-боту и предметной области. За этим этапом следует <button><b>проектирование</b></button>.
keywords: анализ соглашение 
topic: Разработка
label: #чат-бот-разработка-анализ

реализация
На этапе реализации решается вопрос о том, каким способом формируется база знаний чат-бота. Это может быть либо <button><b>обучение</b></button>, либо <button><b>программирование</b></button>, либо использоваться комбинированный подход. Также, перед тем, как осуществить <button><b>внедрение</b></button> проекта, проводят <button><b>тестирование</b></button>.
keywords: реализация реализации 
topic: Разработка
label: #чат-бот-разработка-реализация

pandorabots
<font color="DarkGreen"><b>Pandorabots</b></font> - одна из первых платформ для создания чат-ботов. Очень удобна для создания виртуальных собеседников наподобие A.L.I.C.E.
keywords: pandora пандоработс bots пандора ботс pandorabots 
topic: Платформы
label: #чат-бот-платформа-pandorabots

botlibre
Платформа <font color="SkyBlue"><b>Bot Libre!</b></font> удобна для создания виртуальных собеседников и виртуальных цифровых помощников (VDA).
keywords: ботлибре bot libre botlibre бот либре 
topic: Платформы
label: #чат-бот-платформа-botlibre

dialogflow
Платформа <font color="DarkOrange"><b>Dialogflow</b></font> неплохо подходит для создания виртуальных цифровых помощников (VDA).
keywords: dialogflow флоу flow диалог далогфлоу dialog 
topic: Платформы
label: #чат-бот-платформа-dialogflow

платформы
На сегодняшний день существует несколько платформ для создания чат-ботов. Среди них стоит выделить такие платформы как <button><font color="DarkOrange"><b>Dialogflow</b></font></button>, <button><font color="SkyBlue"><b>Bot Libre!</b></font></button> и <button><font color="DarkGreen"><b>Pandorabots</b></font></button>. Каждая из этих платформ имеет свои преимущества и недостатки, а также использует различные <button><b>языки программирования</b></button>.
topic: Платформы
label: #чат-бот-платформы

aiml
<font color="OrangeRed"><b>AIML</b></font> (англ.  <i>Artificial Intelligence Markup Language</i>) - язык разметки для искусственного интеллекта.  <font color="OrangeRed"><b>AIML</b></font> - подмножество (диалект) <font color="Green"><b>XML</b></font>, он предназначается для создания виртуальных собеседников.  Минимально необходимыми являются три тэга:<br/><font color="Green">&lt;category&gt;</font><br/>&nbsp;&nbsp;&nbsp;&nbsp;<font color="Green">&lt;pattern&gt;</font><font color="">ЧТО ТАКОЕ ЧАТ-БОТ</font><font color="Green">&lt;/pattern&gt;</font><br/>&nbsp;&nbsp;&nbsp;&nbsp;<font color="Green">&lt;template&gt;</font><font color="">Чат-бот - это компьютерная программа, которая создана для имитации речевого поведения человека при общении с одним или несколькими собеседниками.  </font><font color="Green">&lt;/template&gt;</font><br/><font color="Green">&lt;/category&gt;</font><br/>Этот язык разрабатывался Ричардом Уолессом - инициатором проекта <b>A.L.I.C.E.  </b> - и всемирным сообществом свободного ПО с 1995 по 2002 год.
keywords: aiml аимл 
topic: Языки программирования
label: #чат-бот-язык-программирования-aiml

self
Язык программирования <font color="SteelBlue"><b>Self</b></font> является скриптовым языком, который объединяет синтаксис языка <font color="Khaki"><b>JavaScript</b></font>, конечные автоматы (англ. <i>state machines</i>), образцы (англ. <i>patterns</i>) и базу данных объектов (базу знаний).
<br/>
Не стоит путать этот диалект <font color="Khaki"><b>JavaScript</b></font> с прототип-ориентированным языком <font color="SteelBlue"><b>Self</b></font>, изобретённым Дэвидом Унгаром в 1986 году.
keywords: сэлф self 
topic: Языки программирования
label: #чат-бот-язык-программирования-self

языки программирования
При создании чат-ботов используются различные языки программирования. Первым языком программирования, специально созданным для этого был <button><font color="OrangeRed"><b>AIML</b></font></button>. Впоследствии, с увеличением числа платформ для создания чат-ботов, увеличилось и количество используемых ими языков.
<br/>
Движок платформы <font color="DeepSkyBlue"><b>Bot Libre!</b></font> написан на <font color="SaddleBrown"><b>Java</b></font>, в нём имеется скриптовый язык для программирования функций - <button><font color="SteelBlue"><b>Self</b></font></button>, основанный на <font color="Khaki"><b>JavaScript</b></font>.
keywords: языке платформа программирования платформы язык языках движок 
topic: Языки программирования
label: #чат-бот-языки-программирования

программирование
<button><b>Реализация</b></button> чат-бота может осуществляться при помощи непосредственно программирования <button><b>базы знаний</b></button>, используя <button><b>языки программирования</b></button>, которые поддерживает та или иная платформа.
keywords: программирование 
topic: Программирование
label: #чат-бот-программирование

выводы
Стоит отметить, что пока ни пользователи, ни компании не осознают потребности в чат-ботах. Это происходит лишь потому, что о самой технологии пока известно немногим и немногое. Однако стоит сказать, что выиграет тот, кто раньше решит её использовать в своем бизнесе.
<br/>
Например, продажи лазеров в <font color="DimGray"><i>Endurance</i></font> увеличились на <b>30%</b> после того, как мы стали принимать заказы в мессенджерах, в то время как наши конкуренты продолжают общаться с клиентами по телефону и e-mail.
keywords: итог итоги вывод резюме 
topic: Чат-боты
label: #чат-бот-выводы

blockchain
Последнее решение, которое было создано в <font color="DimGray"><b>Endurance</b></font> - это чат-бот, рассказывающий про <i>ICO Blockchain project INS.World</i>. Поскольку многие <i>ICO</i> проекты имеют ядро сообщества в группах таких мессенджеров как <font color="SkyBlue"><b>Telegram</b></font>, то пользователям очень удобно писать и получать ответы прямо в самом мессенджере или даже в самой группе, задавая вопросы чат-боту.
keywords: проект blockchain проекта block-chain блокчейн блокчейна 
topic: Об Endurance
label: #чат-бот-blockchain

blockchain
Данный чат-бот также обучен на ответы на общие вопросы про блокчейн, про криптовалюты, про распределенную базу данных и т. д. Проект реализован на английском языке.
keywords: проект ещё чат-бот blockchain проекта блокчейн далее еще 
previous: #чат-бот-blockchain
topic: Об Endurance

endurance
В <font color="DimGray"><b>Endurance</b></font> создал несколько чат-ботов, которые помогают в обслуживании клиентов. Один из них отвечает на вопросы про лазеры. Для обучения использовалась вся база знаний за 3 года с вопросами и ответами. Сервис не может ответить на 100% возникающих вопросов, но на 80–85% он отвечает довольно точно.
keywords: клиентов облегчают обслуживать обслуживании помогать могут обслуживание людей помогают помощники упрощают 
topic: Об Endurance

endurance
Пример того, как это встраивается в сайт: <a href="https://tehnoobzor.com/hi-tech-news/1883-chatbot-dlya-otvetov-na-voprosy.html"><i>https://tehnoobzor.com/hi-tech-news/1883-chatbot-dlya-otvetov-na-voprosy.html</i></a>.
keywords: может лазеры статья ответить лазерах вопросы обзорных отвечать статей обзор способен отвечающий 
topic: Об Endurance

endurance
<i>Endurance</i>  в переводе с английского значит выносливость, что характеризует направление деятельности компании в целом.
keywords: endurance Endurance значит значение смысл перевод 
topic: Об Endurance

endurance
Другое решение, которым очень охотно пользуются - это чат-бот, способный рассказать про чат-ботов. Который про них и рассказывает в данный момент.
keywords: пример встроить сайт например вопросы отвечающий 
topic: Об Endurance

endurance
Как выглядит чат-бот, рассказывающий о чат-ботах? Он рассказывает и отвечает на вопросы про стоимость разработки, выгоды и преимущества, даёт сравнительные характеристики разных платформ, а также рассказывает о существующих решениях на рынке. Получая эту информацию, пользователи уже далее понимают насколько им эта тема интересна и на сколько они готовы двигаться дальше, чтобы обсуждать бизнес кейс.
keywords: умеет может рассказывает отвечать способен рассказывающий отвечающий отвечает 
topic: Об Endurance

история
В развитие истории о чатботах https://golos.io/aigents/@akolonin/agent-aigents-kak-chat-bot - захотелось понять, насколько продвинулся рынок русскоговорящего исскуственного интеллекта за последние годы. Некоторые результаты беглого наружного осмотра пациента приведены ниже. Для начала, вспомним, что первая более или менее законченная  технология автоматизации разработки чат-ботов появилась лет 15 назад у компании Conversagent - у них для этого был создан специальный язык BuddyScript, мы на нем писали интеграцию  "когнитивного движка" с тогдашними чат-платформами типа MS Messenger - правда, потом эта тема на рынке заглохла на 10 с лишним лет: http://www.marketwired.com/press-release/conversagent-offers-free-buddyscript-sdk-license-development-conversational-msn-messenger-675417.htm
keywords: ход изменение развитие продолжение прогресс развитии 
topic: Чат-боты

история
На сегодняшний день, в связи с оживлением рынка 15 лет спустя, каждый разработчик платформы создания чатботов имеет свой собственный механизм сценариев, вроде https://en.wikipedia.org/wiki/ChatScript и практически все имеющиеся на рынке более или менее серьезные русско-говорящие чатботы предлагают ручное наполнение сценариев диалогов для одной из узко заданных тем. Например, это - решения от Яндекса, Телеграма, Наносемантики (INF.AI) и Google (API.AI). Ну и есть еще несколько популярных ботов, способных в ответ на вопросы пользователя генерировать случайные фразы сомнительного  характера, в том числе с использованием околонормативной лексики.
keywords: разработчик создатель создания разрабы платформы платформ разраб разработчики создатели 
topic: Чат-боты

преимущества
Рассмотрев основные особенности чат-ботов <font color="DimGray"><b>Endurance</b></font>, их функциональность и возможности, можно сделать выводы, что это одно из лучших решений для экономии времени. Чат-боты быстро предоставят вам нужную информацию, напомнят о событии, запомнят нужные данные, отсортируют почту.
keywords: черты преимущество преимущества особенности чатбот функции хорошие характеристики качества 
topic: Чат-боты

тест тьюринга
В связи с чем, несмотря на формальное прохождение Тьюринг-теста несколько лет назад (https://habrahabr.ru/post/226121/) и достижения в области разговорного интеллекта анонсируемые американскими, китайскими и японскими компаниями, с русским языком все обстоит достаточно печально, судя по всему. Возможно, заявленный https://aigents.com ранее подход о необходимости наличия в основе разговорного движка именно семантического механизма, а не множества неполных шаблонов является единственно правильным и требующим дальнейшего развития. Например, для английского языка у нас уже создан чат-бот использующий "контролируемый английский язык" для общения с пользователями, наполняемый как смыслами (элементами онтологии) так и словами (словарным запасом) по ходу разговора: http://aigents.com/test/aigents_turing_test.html
keywords: тьюринг тюринга тюринг тьюринга 
topic: Основные понятия

принцип работы
Чатбот работает очень просто: вы загружаете в него вопросы и ответы, и он обучается, либо программируете для выполнения тех или иных функций. После этого чатбот можно вывести в мессенджер, и далее пользователь сможет в мессенджере совершать те или иные действия, операции, получать ответы на свои вопросы.
keywords: функционирует работает устроен устроены работают работа заключается функционируют 
topic: Основные понятия

срок службы
Срок службы не ограничен
keywords: срок службы ограниченный работы ограничен времени период использования 
topic: Основные понятия

мессенджеры
Чаще всего чатботов используют в мессенджерах WhatsApp, Viber, Telegram, WeChat
keywords: можно найти использование социальные установить сети соц применение возможно наблюдать 
topic: Интеграция

область применения
Везде, даже в банках и службах поддержки
keywords: применяют использовать могут используют именно местах работают применяться использоваться работать 
topic: Область применения

область применения
Например, чатботы помогают более эффективно вести бизнес, коммуницировать с клиентами и много в чем еще могут быть полезны
keywords: применить разрабатывать использование покупать нужны применяются используются разрабатываются создавать нужен создаются использовать применение 
topic: Область применения

область применения
Самая распространенная задача для чатбота — это ответы на часто задаваемые вопросы. Во всех отраслях, практически в любом бизнесе, где требуется осуществлять поддержку действующих или привлечение новых клиентов, довольно остро стоит задача ответов на вопросы.
keywords: важен важны ответы необходим ответов нужны вопросы необходимы нужен 
topic: Область применения

область применения
За последние несколько лет ситуация сильно изменилась в том, что теперь многие пользователи хотят и готовы делать покупки через мессенджеры. Например, в Endurance количество заказов увеличилось на 30 % после того, как в Endurance стали принимать заказы через Whatsapp, Viber, Telegram, Skype, Hangouts, Facebook messenger, Twitter, WeChat, Google Allo и Line.
keywords: человек клиент пользователи через мессенджеров пользователь готовы пробуют помощью делать совершать люди приложения покупки осуществлять купля приложений клиенты хотят 
topic: Область применения

область применения
Клиенты с большим энтузиазмом задают вопросы и получают ответы в месенджерах. Сразу же в них они готовы оформить заказ и далее оплатить. Всё это создает большие возможности для интернет-торговли, но вместе с тем и создаёт дополнительные сложности.
keywords: клиент задать пользователи могут чаще пользователь больше часто мессенджерах люди мессенджеры смогут клиенты вопросы задают 
topic: Область применения

область применения
Одна из таких сложностей, которая возникает — это необходимость отвечать на вопросы 24 часа в сутки 7 дней в неделю. Пока количество клиентов небольшое, то это может делать и один человек, а вот когда запросов более 50–100, то здесь уже требуется автоматизированное решение.
keywords: способность получения ответа необходимость ответов вопрос вопросы отвечать потребность 
topic: Область применения

область применения
При установке на сайте чатбот работает в режиме всплывающего окна. У пользователя создается полное ощущение, что с ним общается человек. Чатбот может помогать в навигации по сайту, а также в проведении интеллектуального поиска. Предоставляет клиентам ответы на вопросы, избавляя их от ненужной информации.
keywords: помощь помощник помогает помогать смысл состоит работа заключается 
topic: Область применения

создание
Сначала вместе с заказчиком составляются требования к чат-боту, исследуется предметная область, исследуются условия, в которых будет работать чат-бот. Затем предметная область должна быть разбита на подмножества, каждое из которых является независимым множеством вопросов и может передано в разработку. После этого начинается концептуальная проработка ответов на основе шаблонов вопросов. В результате получается первичная база знаний чат-бота. Но это ещё не всё. Боту также потребуются дополнительные скрипты и шаблоны.
keywords: личный разработать самому чатбот инструкция создается разрабатывается самостоятельно процесс создать создание 
topic: Разработка
label: #чат-бот-создание

создание
Время на создание чатбота зависит от его назначения и технического задания.
keywords: техническое цели тратится тз ТЗ разработка время нужно занимает дней задание времени трата создание требуется уходит 
topic: Разработка

бота сразу заказать
#чат-бот-заказ
topic: Чат-боты

да
Как вас зовут?
keywords: да продолжить ответить продолжай давай 
require previous: #чат-бот-заказ
topic: Заказы
label: #чат-бот-заказ-вопрос-первый

виды
Простые чат-боты отвечают на простые вопросы.

Функциональные - выполняют функции, например, заказывают пиццу.

Боты-поисковики, самые сложные, могут очень эффективно собирать информацию.
keywords: классы какие чат-ботов чатботы классификация бывают виды чат-боты чатботов разновидности типы 
topic: Чат-боты

удачные примеры
Успешных примеров довольно много. Например, чат-боты <font color="Indigo"><b>Microsoft</b></font>, чат-боты <font color="DarkGreen"><b>Себрбанка</b></font> и т. д. Также нельзя не упомянуть чат-ботов <font color="DimGray"><b>Endurance</b></font>.
keywords: состоявшиеся запад успешных западе примеров россия удавшиеся удачные состоявшихся россии успешные примеры сша америка удачных удавшихся 
topic: Чат-боты

уточнения
Проблема выбора - это всегда сложная проблема. Чат-бот может задавать уточняющие вопросы, после чего предложить ответ. Это т. н. <b>дерево выбора</b>.

Например, на сайте <a href="http://endurancelasers.com">EnduranceLasers.com</a> уже установлен бот, который спрашивает про лазеры и уточняет у пользователя различные детали.
keywords: помочь уточнить уточнения нужно точно знает туристическую поездку ноутбук пользователь выбрать 
topic: Чат-боты

дерево выбора
Чат-боты могут отвечать на сложные вопросы более эффективно, если вопрос разбить на несколько уточнений, произвести декомпозицию.

<b>Например</b>:
1. Какая марка машины интересует?
2. Какой ценовой диапазон?
3. Какой цвет предпочтительней?
4. Какая коробка передач необходима?
...и т. д., после чего робот выдаёт ответ, например, что идеально подходит <b>BMW X4</b>.
keywords: задачи решать разветвленным пользователю дерево выборов помочь деревом может разветвленное помогать задачу сложные выбора 
topic: Чат-боты

перспективы
Сложно сказать наверняка, но тенденция такова, что люди чаще прибегают к услугам роботов. Этой теме у нас посвящена отдельная статья: <a href="http://old.endurancerobots.com/budushhee-vzaimodejstvie-lyudej-i-botov">http://old.endurancerobots.com/budushhee-vzaimodejstvie-lyudej-i-botov</a>.
keywords: идет взгляд какую будущее перспективы развитие сторону 
topic: Чат-боты

перспективы
Боты — перспективное направление в развитии ИИ. Мимикрируя под людей, они получают больше доверия, способны приносить больше пользы и решать реальные проблемы. Человеку естественно говорить о проблемах в ходе диалога, боты дают такую возможность, снижая нагрузку на бизнес, на государственные учреждения. Когда алгоритм говорит человеческим голосом, обладает грамотной письменной речью, человеку все проще воспринимать его как полноценного собеседника. При этом технологии развиваются и боты получают человеческие лица, способные выражать эмоции. В конечном итоге боты плотнее внедряются не только в бизнес-процессы, но и во многие сферы жизни человека. Политика просто не могла остаться в стороне.
keywords: интеллекта перспективны искусственный направлены направление искусственного интеллект перспективные перспективное развитие перспектива ИИ ии развитии 
topic: Чат-боты

конфликты
С роботом особо не поконфликтуешь. Конфликт может возникнуть тогда, когда пользователь требует "живого общения", а не разговора с бездушной и "глуповатой" машиной, после чего шлёт гневные обращения администрации ресурса. Хорошо продуманные электронные собеседники вызывают больше симпатии и завоёвывают расположение пользователя.
keywords: конфликтов конфликты были случаи 
topic: Чат-боты

проблемы
Основная проблема взаимодействия пользователей с чат-ботом заключается в том, что они могут и задают вопросы, на которые чат-бот обучен не был. В результате остаются недовольны. Поэтому очень важно тщательно прорабатывать базу знаний чат-бота.
keywords: чат-ботом проблема нюансы сложности при общении чатботом использовании использованием проблемы основные ботом 
topic: Чат-боты

проблемы
Сбои могут произойти из-за некорректного вопроса. А так же по техническим причинам.
keywords: сбой работе происходят поломки неполадки бывают возможны 
topic: Чат-боты

реакция пользователей
Пользователи обычно хорошо воспринимают хорошо проработанные интерактивные системы, в том числе и чат-ботов. Чат-боты, которые используют трёхмерную анимированную модель и/или голосовое сопровождение вызывают очень высокий уровень доверия у потенциальных клиентов так, что они готовы работать с такими системами, что позитивно сказывается на коммерческой деятельности.
keywords: какая пользователей реагируют реакция покупатели пользователи у покупателей 
topic: Чат-боты

конверсия
Если чат-бот сделан хорошо, то, как правило, конверсия в заказы на сайте будет намного больше чем, через обычную форму. Люди предпочитают общаться, а интерактивность чат-ботов намного упрощает процесс оформления заказа.
keywords: какая конверсия заказы из разговоров 
topic: Чат-боты

выгода
Если чат-бот сделан хорошо, то многие пользователи готовы через него сделать заказ, что позволяет разгрузить штат консультантов (продавцов-консультантов).

Например чат-бот по подбору сотрудников в <i>Endurance</i> (практикантов) увеличил конверсию в <b>десять</b> раз. Попробовать можно здесь: <a href="http://old.endurancerobots.com/practice">http://old.endurancerobots.com/practice</a>.
keywords: заказ доходят пользователей заказа сколько прибыль прибыльность пользователи от выгода заказы 
topic: Чат-боты

выгода
При установке на сайте чатбот работает в режиме всплывающего окна. У пользователя создается полное ощущение, что с ним общается человек. Чатбот может помогать в навигации по сайту, а также в проведении интеллектуального поиска. Предоставляет клиентам ответы на вопросы, избавляя их от ненужной информации.
keywords: помощь помощник помогает помогать смысл состоит работа заключается 
topic: Чат-боты

популярность
Один из десяти (в среднем около 10%) посетителей сайта обращаются к чат-боту с вопросом. Такая популярность роботов-собеседников обусловлена тем, что для многих это является чем-то новым и не до конца понятным, многие люди просто не знают как пользоваться интерактивной помощью робота-собеседника.
keywords: популярность среди пользователи обращений говорить чат-ботом пользователей начали зашедших популярны сколько сайт обращаются 
topic: Чат-боты

популярность
Чтобы чатботы приобрели должную популярность необходимо создать (модернизировать) платформу по их созданию (выпуску), сделав её очень простой. Сейчас процесс создания элементарного бота занимает не более 10 минут, тем не менее, это требует знаний в предметной области. Например, на базе платформы Botlibre можно создать очень удобный и понятный интерфейс, по которому пользователи бы создавали своих ботов.
keywords: чатбот популярны знамениты популярность знаменитые известно знакомы популярные известность привычны привычные знакомый 
topic: Чат-боты

консультант
Чат-бот может дублировать человека-консультанта. Можно создавать чат-комнаты, когда чат-бот будет отвечать только в том случае, если консультанта нет на месте. Это очень удобно. Кроме того чат-бот может вести журнал и передавать записи консультанту, также консульт может исправлять неверные ответы на правильные в случае, если чат-бот неверно отвечал на вопросы пользователя.

В службах технической поддержки и обратной связи различных сервисов очень широко используются чат-боты.
keywords: техподдержки могут специалиста консультанта заменять оператора чат-боты живого дублировать технической заменить поддержки 
topic: Чат-боты

акционные предложения
<b>TODO</b>: акционные предложения

Что касается акционных предложений, то есть концепция чат-бота <i>wish-бота</i>, который поможет найти то, что душе угодно: <a href="http://old.endurancerobots.com/wish-bot">http://old.endurancerobots.com/wish-bot</a>
keywords: акционные предложения как работают 
topic: Чат-боты

фильтр товаров
<b>TODO</b>: фильтр товаров

Чат-боты могут искать что-то, например, чат-бот HR ищет вакансии по ключевым словам и отлично справляется с этой задачей <a href="http://old.endurancerobots.com/hr-chatbot">http://old.endurancerobots.com/hr-chatbot</a>
keywords: товаров чатбот чат-бот могут чатботы как заменять чат-боты собой фильтр 
topic: Чат-боты

готовые решения
Описание готовых коммерческих решений можно найти по адресу: <a href="http://old.endurancerobots.com/opisanie-raboty-kommercheskix-chatbotov-endurance">http://old.endurancerobots.com/opisanie-raboty-kommercheskix-chatbotov-endurance</a>
keywords: есть готовых готовые готовыми решениями какие существуют решений вас решения 
topic: Чат-боты

crm интеграция
Можно сделать так, чтобы чат-бот отвечал на вопрос относительно статуса доставки или посылки. Для этого нужно интегрировать чат-бота в CRM систему, где хранятся данные о доставке с трек-номерами, после чего трек-номера можно проверять через API сервиса доставки.
keywords: статус заказа crm может товара складе интеграция уточнять наличие 
topic: Чат-боты

функции
Чат-бот умеет отвечать на вопросы пользователей. Также чат-бот может выполнять какие-то простые действия, как сортировка и отправка ответов по почте, может помогать находить ценную и полезную информацию, автоматизировать действия с различными сервисами.

<b>Например</b>, если нужно найти ближайшее кафе, то вы можете отправить ваши геолокационные данные, а чат-бот, обратившись к сервису <font color="Red"><b>Google Maps</b></font>, сможет найти ближайшее кафе.

В целом, у чат-ботов довольно обширный функционал.
keywords: делать современный умеет функции образованный лучше всего фичи получается 
topic: Чат-боты
label: #чат-бот-функции

функции
К DoNotPay можно обратиться, чтобы вернуть деньги за покупки по кредитной карте, которые совершили мошенники, решить вопросы по декрету, запретить компаниям звонить с рекламными предложениями и многое другое. Обновлённый чат-бот поможет оформить документы, чтобы обязать владельца дома починить трубу или проверить газовое оборудование. Таким образом, он позволит не только сэкономить деньги, но и предотвратить трагедии.
keywords: цели функции чатбот способен назначение направление функционирование функциональность делать помочь помощник направления может функционал обязанности работа цель 
topic: Чат-боты

функции
Большинство действующих банковских ботов оперирует информационно-сервисными функциями. Например, официальный бот Сбербанка @SberbankBot позволяет узнать адреса ближайших отделений, банкоматов и партнеров бонусной программы, для этого нужно отправить боту свое местоположение. Также можно узнать актуальные котировки валют и драгметаллов, получить совет или получить информацию о банке, в том числе в видео-формате.
keywords: цели функции способен назначение работать направление функциональность функционирование делать помочь помощник боты направления может функционал обязанности цель 
topic: Чат-боты

e-commerce
Чтобы создать своего чат-бота необходимо обратиться к разработчикам <i>Endurance</i>, а также можно посмотреть видео о том, как сделать своего чат-бота с нуля: <a href="https://www.youtube.com/watch?v=8ExxxYKOrY4">https://www.youtube.com/watch?v=8ExxxYKOrY4</a>.

<b>Но помните</b>, что лучше доверить разработку чатбота профессионалам.
keywords: нуля e-commerce запустить как 
topic: Чат-боты

стоимость
В среднем, стоимость разработки профессионального корпоративного чат-бота варьируется от 50 тыс. до 500 тыс. рублей, но, правда, бывают и исключения.
keywords: чат-бота разработать чатбота своего внедрения разработки стоит внедрение стоимость cколько внедрить разработка 
topic: Чат-боты
label: #чат-бот-стоимость

чат-бот политик
<b>TODO</b>: чат-бот политик
Пока SAM не обладает опытом живого политика, но многим людям он уже пришелся по душе: по крайней мере он не способен принести вреда.  В отличие от живых политиков, он всегда доступен для диалога, написать ему может любой, кто владеет английским и аккаунтом в Facebook.  Бот готов обсудить проблемы здравоохранения, образования, социальные проблемы или поговорить на любые другие темы.  При этом важно, что это будет не пространный диалог о глобальном — он будет привязан к реальной жизни в Новой Зеландии.  Бот знает статистику, разбирается в текущем состоянии дел и готов делиться этим с собеседником.  Очевидно, что SAM в сегодняшнем его виде не способен выполнять всех функций реального политика.  Но проект, скорее, задает вопрос обществу и заставляет задуматься о будущем, о функциях власти.  Это рассуждение авторов на тему того, что происходит с политикой сейчас и как она трансформируется потом.  Есть мнение, что ИИ в политических вопросах может обеспечить непредвзятость.  Для алгоритма без желаний и страстей все люди буд т одинаково важны — или на том уровне, на котором это запрограммируют.  Но это поднимает уже другие вопросы, не передаст ли человек свои представления о мире и свои стереотипы алгоритму.
keywords: человека опытом опыт политического политика живого дипломата 
topic: Чат-боты

чат-бот политик
Издание Techinasia интересуется, смогли бы люди проголосовать за политика, который является не человеком, а чат-ботом. Как раз такого создал стартап из Новой Зеландии. Алгоритм по имени SAM знает все о новостной повестке Новой Зеландии, о цифрах и о фактах, и как истинный политик дает законченные ответы, уходя при этом от вопроса.
keywords: политике политик политика дипломат политический 

чат-бот политик
Чат-бот может стать посредником между политиками и народом. В этом уже сейчас может быть его важная политическая роль. Создатели говорят, что выборы в Новой Зеландии пройдут в 2020 году. Они уверены, что к тому времени бот станет более продвинутым и теоретически сможет попробовать баллотироваться. Это важный этап для политики, потому что общество ждет только политический мрак, пока в 21 веке управляют методами из 19, считают в компании.
keywords: политике политика 
topic: Чат-боты

чат-бот политик
Например, бот от Microsoft, способный к самообучению, всего за 24 часа стал расистом и сексистом. Так что SAM заставляет задуматься об идеальном политике будущего: цифровом, непредвзятом и справедливом. Сегодня, когда настоящий ИИ только формируется, есть шанс создать то, что поможет людям. Если забыть о философской стороне создания ИИ-политика, то разработчики SAM говорят, что уже сегодня он способен приносить реальную пользу обществу. По их мнению, чат-бот хороший инструмент для сбора статистики и учета общественного мнения. В разговоре с алгоритмом о насущных проблемах, человек может высказывать важные и волнующие его проблемы. Если анализировать эти данные, то реальная человеческая власть может сокращать разрыв с обществом, решать действительно важные проблемы.
keywords: microsoft микрософт 
topic: Чат-боты

проектирование
Этап проектирования предполагает моделирование предметной области, либо функционала будущего чат-бота. Например, для моделирования чат-бота можно применить семантический граф, построенный на основе анализа предметной области, как на картинке: <img src="https://raw.githubusercontent.com/Endurance-Robotics/ChatBots/master/botlibre/botabout/chatbots.png"/><br/>
После проектирования идёт непосредственно <button><b>реализация</b></button> чат-бота.
keywords: проектирование 
topic: Разработка
label: #чат-бот-разработка-проектирование

парсер email
<b>TODO</b>: парсер email

Он собирает email по вашему запросу. Можно парсить одновременно сразу 10, 50, 100 запросов, например: Кожевенные мастерские Москвы, Кожевники Москвы, Изделия из кожи Москва И т.д.  по 5, 10, 25 стр. гугла, охватывая фактически по 250 сайтов для одного запроса и даже больше.
keywords: мэйлов email необходим использовать mail применять нужны emailов парсер необходимы нужен мэйл 
topic: Чат-боты

разработка
Процесс разработки чат-бота представляет собой поэтапный циклический процесс как на картинке: <img src="https://raw.githubusercontent.com/Endurance-Robotics/ChatBots/master/development.png"/><br/>
Основные этапы которого - это: <button><b>анализ</b></button>, <button><b>проектирование</b></button>, <button><b>реализация</b></button>, <button><b>тестирование</b></button>, <button><b>внедрение</b></button> и <button><b>сопровождение</b></button>.
keywords: разработке разработки разработка создание этапы 
topic: Разработка
label: #чат-бот-разработка

база знаний
В основе любого чат-бота, как правило (а для самообучающихся - это непременно так), лежит база знаний.

<b>База знаний, БЗ</b> (англ.  <i>knowledge base, KB</i>) — база данных, содержащая правила вывода и информацию о человеческом опыте и знаниях в некоторой предметной области.

Полноценные базы знаний (в отличие от обычной базы данных) содержат в себе не только фактическую информацию, но и правила вывода, позволяющие делать автоматические умозаключения об уже имеющихся или вновь вводимых фактах и тем самым производить семантическую (осмысленную) обработку информации.
keywords: знания построен лежит основе базис основа база данных данные основан знаний 
topic: Чат-боты

обучение
<b>Обучение (тренировка) чат-бота</b> - это противоположный проектированию способ разработки. Обучение осуществляется специалистами в режиме диалога с чат-ботом, в ходе которого специалист задаёт вопросы и проверяет правильность ответов, а чат-бот отвечает, а также сам задаёт вопросы, на которые специалист даёт эталонные ответы.

Чат-бот должен быть обучен на грамотных вопросах и грамотных ответах без частной информации (не должно быть имен или ссылок на предыдущие диалоги).  Кроме того, необходимо провести несколько пилотных тестирований. Даже если чатбот создан и работает хорошо, его нужно постоянно улучшать, смотреть логи и корректировать ответы.
keywords: обучают обучение реализуется как ответ происходит вопрос осуществляется 
topic: Чат-боты

заказ
Ознакомиться с демонстрационными чат-ботами можно на странице сайта <i>Endurance</i> по адресу <a href="http://endurancerobots.com">http://endurancerobots.com</a>.

Заказать чат-бота можно, связавшись с представителями компании <i>Endurance</i>. Они помогут определиться с выбором и составить техническое задание.

Связаться с Георгием можно по телефону <b>+7 (916) 225 43 02</b>. Также можно оправить запрос на почту, ответив на несколько вопросов. Ответить на вопросы?
<br/>
<button>Да</button> <button>Нет</button>
keywords: заказ сделать заказать определиться взять какой выбором где как мне выбрать 
topic: Чат-боты
label: #чат-бот-заказ

заказ
Если вы хотите заказать разработку чатбота — напишите нам об этом на info@endurancerobots.com Или позвоните +79162254302 (в том числе через мессенджеры: WhatsApp, Viber, Telegram, WeChat) или через Facebook Messenger @george.fomitchev
keywords: написать позвонить заказ сделать заявку нужно оставить обратиться 
topic: Чат-боты

ключевые слова
Чат-бот ориентируется по ключевым словам, т. к. не может полноценно понимать естественные языки. В принципе, можно даже не формулировать предложение целиком, а вводить <b>отдельные слова</b> или <b>фразы</b> как, например, в поисковике <font color="Red"><b>Google</b></font>.
keywords: фразы найти совпадения ты искать слова ключевые понимать ключевое отдельные поиск понимаешь ключевым слово словам 
topic: Чат-боты
label: #чат-бот-ключевые-слова

уделить время
#чат-бот-темы
keywords: время можешь своего немного уделить спросить времени 
required: уделить времени 
topic: Чат-боты

темы
Я могу предоставить информацию по некоторым темам относительно чат-ботов.
<br/>
<button>Виды чат-ботов</button>
<button>Функции чат-ботов</button>
<button>Эффективность чат-ботов</button>
<button>Интеграция чат-ботов</button>
<button>Популярность чат-ботов</button>
<button>Выгода от чат-ботов</button>
<button>Стоимость чат-ботов</button>
<button>Разработка чат-ботов</button>
<button>Как сделать заказ</button>
keywords: можно беседа теме скажи меню тема спросить темами темам навигатор можешь чем рассказать поговорить какие навигация расскажи тем чём темы 
topic: Чат-боты
label: #чат-бот-темы

интеграция
Чат-боты могут работать, как на сайте, так и в любом мессенджере. Среди таких мессенджеров <font color="SkyBlue"><b>Twitter</b></font>, <font color="RoyalBlue"><b>Facebook</b></font>, <font color="DodgerBlue"><b>Telegram</b></font>, <font color="Orange"><b>Slack</b></font>, <font color="DeepSkyBlue"><b>Skype</b></font>, <font color="LawnGreen"><b>WeChat</b></font>, <font color="LimeGreen"><b>Kik</b></font>. Также чат-бот способен работать с <b>электронной почтой</b>, <b>SMS</b>-сообщениями, <b>IRC</b>-каналами и сервисами <font color="Red"><b>Google</b></font>.
keywords: kik skype встраивание скайп фейсбук slack messenger мессенджер интеграция twitter google wechat messengers гугл телеграм мессенджеры встроить telegram сайт сайте facebook твиттер чатботов интегрировать 
topic: Чат-боты
label: #чат-бот-интеграция

эффективность
Чат-боты эффективны там, где работа оператора требует не глубокого понимания, а большого количества однообразной работы. Чат-бот способен быстро подобрать ответ на вопрос из конкретной области. Чат-бот способен заменить собой справочную систему.
keywords: эффективен области областей каких эффективный областях эффективны эффективность 
topic: Чат-боты
label: #чат-бот-эффективность

помоги
#чат-бот-темы
keywords: помощь делать сделать помочь можешь оказать обучен 
topic: Чат-боты

чат-бот
<b>Чат-бот, виртуальный собеседник</b> (англ. <i>chatterbot</i>) - это компьютерная программа, которая создана для имитации речевого поведения человека при общении с одним или несколькими собеседниками. По отношению к виртуальным собеседникам употребляется также название программа-собеседник.

Чат-бот использует технологии искусственного интеллекта (ИИ), чтобы оказывать информационную поддержку, развлекать, квалифицировать собеседника (в случае коммерческих чат-ботов - клиента).
keywords: такое чат-бота определение чатбота про чатбот чат-бот расскажи что хорошо 
topic: Чат-боты

чат-бот
Многофункциональная программа помогает HR-менеджерам использовать чатботы для тестирования кандидатов. Благодаря встроенному конструктору, HR-менеджер может самостоятельно создавать чатботы и публиковать их в мессенджерах Viber, FacebookMessenger, Telegram. Кандидатам остается только получить ссылку, зарегистрироваться и пройти тест.
keywords: такое beesender Beesender HR hr бисендер подробнее название такой подробности описание 
required: bot hr beesender 
topic: Чат-боты

чат-бот
Вера — робот-рекрутер. Она найдет подходящие резюме, обзвонит кандидатов и проведет собеседование. Вера может за несколько минут сделать выборку из 5 работных сайтов по заданным требованиям. С помощью современных технологий Вера может звонить кандидатам и распознавать их речь. Еще Вера может отправить кандидатам на почту описание вакансии и может провести с ними видеособеседование.
keywords: такое вера верка робот подробнее название vera такой подробности описание 
required: robot vera 
topic: Чат-боты

чат-бот
С помощью LSSender можно автоматически рассылать во «ВКонтакте» сообщения, приглашения, отметки «мне нравится» и не только. 5. PresentationBot Помогает готовиться к презентациям. Есть несколько вариантов: может посоветовать статьи, книги или публикации, подготовить план презентации вместе с пользователем либо направить на человека, который поможет с презентацией.
keywords: такое lssender подробнее название такой LSSender подробности описание 
required: lssender 
topic: Чат-боты

чат-бот
Раньше, чтобы читать разные информационные порталы, приходилось добавлять в мессенджер виртуального докладчика конкретного издания. Таким образом, образовывалось огромное количество чатов. Но с появлением бота @kiosk_rubot нашлось решение и этой проблемы. «Киоск» открывает доступ к 57 новостным сайтам. Читать «Сноба», «Ленту.ру», «Новую газету» и другие издания можно в одном месте.
keywords: такое рубот RuBot подробнее kiosk название такой киоск подробности rubot описание 
required: rubot kiosk 
topic: Чат-боты

чат-бот
Meduza — это официальный телеграм-бот независимого общественно-политического издания Meduza. Бот умеет показывать не только последние новости с сайта, но и присылать только те новости, которые актуальны для конкретного пользователя.
keywords: такое подробнее медуза название meduza такой подробности описание 
required: meduza 
topic: Чат-боты

чат-бот
При помощи этого бота можно получать лучшие фотографии National Geographic со всего мира через Telegram-мессенджер, заранее выбрав интересную тематику.
keywords: такое bot подробнее нэштнэл географик имя geographic название бот national такой описание подробности 
required: geographic bot national 
topic: Чат-боты

чат-бот
Виртуальная девушка чатбот Иви — один из самых популярных чатботов в мире. Она может общаться на разных языках, в том числе на русском. Коммуницировать с ней можно как при помощи текста, так и при помощи голоса. Отвечать она будет и голосом, и текстом одновременно. С Ivi можно обсудить любые вопросы и проблемы. С юмором у нее все в порядке, как и у Алисы. Можно посмеяться и потроллить.
keywords: иви ivi подробнее название подробности 
required: ivi 
topic: Чат-боты

чат-бот
Этот бот находит архивы известных радиостанций и отправляет названия песен в ответ на запрос, работает по аналогии с Shazam, используя не мелодию, а выдержку из текста песни.
keywords: имя радио подробнее bot название бот radio описание подробности 
required: bot radio 
topic: Чат-боты

чат-бот
ШтрафыБот — этот чатбот не только проверяет наличие штрафов, но и помогает погасить задолженность. Если после оплаты посредством бота на сайте ГИБДД все еще будет висеть информация о неоплаченном штрафе, программа вернет средства владельцу, даже если платеж был проведен.
keywords: полезный нужный полезные необходимые штрафбот штрафов нужные необходимый шртафыботы 
required: штрафыбот 
topic: Чат-боты

чат-бот
в мире создано более 100 тыс чатботов
keywords: есть чатбот количество создано тысячи мире всего число существует 
topic: Чат-боты

чат-бот
Чатбот – это интерфейс общения с компьютером, как с живым человеком в мессенджере. Мы сейчас уже проводим большую часть времени в мессенджерах. Больше, чем в соц. сетях и во всем интернете. Это говорит о том, люди хотят и им нравится диалоговое общение.
keywords: люди различия различаются человек чатбот общение лучше отличия сравнение сравнивание отличаются 
required: или 
topic: Чат-боты

чат-бот
HR чатбот имеет реализацию нескольких функций. В первую очередь — это функция поиска по базе вакансий. Можно посмотреть все вакансии по Москве или Санкт Петербургу. Можно посмотреть список всех компаний, которые предлагают работу. Можно искать вакансии: по ключевым словам, ключевым фразам или по названию компании.
keywords: пример предложить Hr hr HR бота посмотреть база узнать вакансии поик бот работа предлагают привести 
required: hr 
topic: Чат-боты

как создается чат-бот
Сначала вместе с заказчиком составляются требования к чат-боту, исследуется предметная область, исследуются условия, в которых будет работать чат-бот. Затем предметная область должна быть разбита на подмножества, каждое из которых является независимым множеством вопросов и может передано в разработку. После этого начинается концептуальная проработка ответов на основе шаблонов вопросов. В результате получается первичная база знаний чат-бота. Но это ещё не всё. Боту также потребуются дополнительные скрипты и шаблоны.
keywords: личный разработать самому чатбот инструкция разрабатывается создается самостоятельно процесс создать создание 
topic: Чат-боты
label: #чат-бот-создание

чат
<b>Чат, чаттер</b> (англ. <i>chatter</i> - болтать) - средство обмена сообщениями по компьютерной сети в режиме реального времени, а также программное обеспечение, позволяющее организовывать такое общение. Характерной особенностью является коммуникация именно в реальном времени или близкая к этому, что отличает чат от форумов и других "медленных" средств.
keywords: чат 
required: чат 
topic: Чат-боты
label: #чат-бот-чат

корпоративная база знаний
Главная цель создания таких баз — помочь менее опытным людям найти уже существующее описание способа решения какой-либо проблемы.
keywords: узкая замкнутая базис основа корпоративная данных данные база знаний 
topic: Чат-боты

/start
Template("Добро пожаловать, {speaker}, я готов помочь с возникающими вопросами.")
topic: Чат-боты

привет
Приветствую, я могу помочь разобраться с вопросами на тему чат-ботов: что это такое, и какие они бывают, зачем они нужны, и как заказать чат-бота в <b>Endurance</b>. Я также могу ответить и на другие вопросы, но, разумеется не все. Для удобства лучше спросить о темах, либо использовать

<button>Навигатор по темам</button>
keywords: гутен salve здрасьте greetings морген привет доброе дела здоров прива здорова ghbdtn времени доброго hi hail суток добрый hello как здравствуйте здравствуй здаров хай утро вечер салют шалом 
topic: Чат-боты

